app/controllers/batches_controller.rb

  def index
    # Получаем список всех загруженных файлов
    @batches = Batch.all
---
SELECT "batches".* FROM "batches"

  def create
    # Сохраняем данные из загруженного файла
    # Инициализируем объект Batch с параметрами
    @batch = Batch.new(batch_params)
    # Загруженный файл
    uploaded_io = params[:batch][:batch_file]
    @file_path = "/public/uploads/#{uploaded_io.original_filename}"
    @xml_file = File.new(Rails.root.join('public', 'uploads', uploaded_io.original_filename))
    # Создаем новый документ XML. Выбираем интересующие нас элементы по имени/шаблону
    @xml_doc = Document.new(@xml_file)
    @root = @xml_doc.root
    @file_attribute_guid = @root.elements["FileAttribute/GUID"]
    # Берем содержимое ноды
    @batch.guid = @file_attribute_guid.text

    # Ищем загруженный файл в базе по GUID
    @existing_batch = Batch.find_batch_by_guid(@batch.guid)

    if @existing_batch != nil
      # Если файл существует, не сохраняем его данные
      @guid_error = "Batch file with GUID provided already exists in database"
    else
      # Файл не найден в базе, обрабатываем его данные
      @batch_id_data = @root.elements["FileData/Batch/BatchID"]
      @batch.batch_id = @batch_id_data.text
      @batch_creation_date_data = @root.elements["FileData/Batch/CreationDate"]
      @batch.creation_date = @batch_creation_date_data.text
      @batch.batch_file = @file_path
      # Сохраняем данные загруженного файла в базу
      @batch.save

      # Для каждой ноды "Invoice" внутри "FileData" сохраняем её данные в соответствующую таблицу БД
      @root.elements.each("FileData/Invoice") do |invoice|
        @invoice = @batch.invoices.create(
          invoice_operation_number: invoice.elements["InvoiceOperation/InvoiceOperationNumber"].text,
          invoice_operation_date: invoice.elements["InvoiceOperation/InvoiceOperationDate"].text,
          company_code: invoice.elements["InvoiceOperation/CompanyCode"].text,
          )
---
INSERT INTO "batches" ("created_at", "updated_at", "batch_file") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", "2020-01-25 10:33:46.768729"], ["updated_at", "2020-01-25 10:33:46.768729"], ["batch_file", "#<ActionDispatch::Http::UploadedFile:0x000000000b37f4f0>"]]
INSERT INTO "batches" ("guid", "created_at", "updated_at", "batch_file") VALUES ($1, $2, $3, $4) RETURNING "id"  [["guid", "ABCDEF"], ["created_at", "2020-01-25 10:47:50.950988"], ["updated_at", "2020-01-25 10:47:50.950988"], ["batch_file", "#<ActionDispatch::Http::UploadedFile:0x000000000c397478>"]]
INSERT INTO "invoices" ("invoice_operation_number", "invoice_operation_date", "company_code", "batch_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

        # Теперь повторяем то же самое для каждого товара в инвойсе
        # Выбираем ноды "InvoiceData" внутрни инвойса и сохраняем их данные в таблицу invoice_data_items
        invoice.elements.each("InvoiceData") do |invoice_data_item|
          @invoice_data_item = @invoice.invoice_data_items.create(
            parcel_code: invoice_data_item.elements["ParcelCode"].text,
            item_qty: invoice_data_item.elements["ItemQty"].text,
            parcel_price: invoice_data_item.elements["ParcelPrice"].text,
            )
          # Сохраняем данные в БД
          @invoice_data_item.save
---
INSERT INTO "invoice_data_items" ("parcel_code", "item_qty", "parcel_price", "invoice_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["parcel_code", "114211372050132"], ["item_qty", 1], ["parcel_price", 3493], ["invoice_id", 10], ["created_at", "2020-01-25 13:30:24.866644"], ["updated_at", "2020-01-25 13:30:24.866644"]]
INSERT INTO "invoices" ("invoice_operation_number", "invoice_operation_date", "company_code", "batch_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
INSERT INTO "invoice_data_items" ("parcel_code", "item_qty", "parcel_price", "invoice_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["parcel_code", "114211372050132"], ["item_qty", 1], ["parcel_price", 3493], ["invoice_id", 12], ["created_at", "2020-01-25 13:37:20.860140"], ["updated_at", "2020-01-25 13:37:20.860140"]]

        format.json { head :no_content }
      else
        # Если сохранение объекта Batch прошло удачно, переходим на страницу показа и показываем соответствующее сообщение
        if @batch.save
---
INSERT INTO "batches" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2020-01-25 09:43:47.358218"], ["updated_at", "2020-01-25 09:43:47.358218"]]

    def set_batch
      # Находим данные объекта Batch по id
      @batch = Batch.find(params[:id])
---
SELECT "batches".* FROM "batches" WHERE "batches"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]