app/models/batch.rb

SELECT "batches"."batch_id" FROM "batches" WHERE "batches"."guid" = $1 ORDER BY "batches"."id" ASC LIMIT $2  [["guid", "16BA036FCC3D4AF7E05378A06D0ADD38"], ["LIMIT", 1]]
---
    def self.find_batch_by_guid(guid)
        batch = Batch.select("batch_id").where(:guid => guid).first